$(document).ready(function () { //////////////////////////////// JQB //////////////////////////////////////////

    if (1041 > $(window).width()) {

        var chart = bb.generate({
            title: {
                text: ""
            },
            data: {
                json: {
                    "시가": [5490, 5400, 5270, 5480, 5560, 5540, 5540, 5510, 5420, 5440],
                    x: ["09-07-2020 00:00", "09-08-2020 00:00", "09-09-2020 00:00", "09-10-2020 00:00", "09-14-2020 00:00", "09-15-2020 00:00", "09-15-2020 00:00", "09-16-2020 00:00", "09-17-2020 00:00"]
                },
                x: "x",
                type: "area",
                xFormat: "%m-%d-%Y %H:%M"
            },
            area: {
                linearGradient: true
            },
            axis: {
                x: {
                    tick: {
                        fit: false,
                        multiline: false,
                        autorotate: true,
                        rotate: 0,
                        culling: false,
                        count: 5,
                        format: /*%Y년*/ "%m월 %d일"
                    },
                    type: "timeseries"
                }
            },
            bindto: "#stock_chart"
        });

        chart.axis.range({ // Y축 차트 시작값 조정
            min: {
                /*
                                    x: 0,*/
                y: 5050,
                /*y2: 0*/
            }
        });


    } else {


        var chart = bb.generate({
            title: {
                text: ""
            },
            data: {
                json: {
                    "시가": [5490, 5400, 5270, 5480, 5560, 5540, 5540, 5510, 5420, 5440, 5420, 5230, 5200, 5050, 5150, 5220, 5330, 5320],
                    x: ["09-07-2020 00:00", "09-08-2020 00:00", "09-09-2020 00:00", "09-10-2020 00:00", "09-14-2020 00:00", "09-15-2020 00:00", "09-15-2020 00:00", "09-16-2020 00:00", "09-17-2020 00:00", "09-18-2020 00:00", "09-21-2020 00:00", "09-22-2020 00:00", "09-23-2020 00:00", "09-24-2020 00:00", "09-25-2020 00:00", "09-28-2020 00:00", "09-29-2020 00:00", "10-05-2020 00:00"]
                },
                x: "x",
                type: "area",
                xFormat: "%m-%d-%Y %H:%M"
            },
            area: {
                linearGradient: true
            },
            axis: {
                x: {
                    tick: {
                        fit: false,
                        multiline: false,
                        autorotate: true,
                        rotate: 0,
                        culling: true,
                        count: 10,
                        format: /*%Y년*/ "%m월 %d일"
                    },
                    type: "timeseries"
                }
            },
            bindto: "#stock_chart"
        });

        chart.axis.range({ // Y축 차트 시작값 조정
            min: {
                /*
                                    x: 0,*/
                y: 5050,
                /*y2: 0*/
            }
        });


    }



}); //////////////////////////////// JQB //////////////////////////////////////////
